{"lastId":100566868628733200,"toots":["When I tell people I have friends\n","I see a lot of new users on the fediverse\nso to anyone from you with good intentions, welcome :)\n","My CW stats:\n20% shitpost\n80% shitpost + bad joke\n","Mass-Udon is my favorite decentralized food\n","@jusdepatate @Frozen @Bastien @DocWeed @Electron @clexy \nmerci à tou·te·s pour vos réponses \nc'est probablement le terme de «chasse» qui me dérange le plus dans cette histoire. Et cette tendance à traiter les personnes problématiques comme un ensemble, un bloc qui pourrait aussi regrouper d'autres personnes qui n'ont pas (ou pas encore) posé problème\nSi c'est méchant, si c'est haineux, si c'est toxique, ciao. Mais svp pas de raccourcis, ils s'agit de personnes\n","Quel est le problème avec le fait d'avoir de nouvelles personnes qui rejoignent le fediverse ?\niels ont tou·te·s fait qqc de mal ou c'est «préventif» ?\n","Bonjour tout le monde,\nPourquoi tout le monde parle d'une liste sur un doc excel ? CKOI? Cgrave ?\nDeso, je suis en vacances alors je suis un peu déconnecté 😎\n","Is reading books in a cave what everybody calls deep learning ?\nHave a good day\n","First day in Prague. It's hot. I've been expecting worse, but still\nCan't read anything tho\n","@thierry welcome !\n","If any of you wants to give me tips about things to do / not do, eat, visit… in Prague, Czech Republic \ndo it now, my flight is friday :)\nor don't\n","WoRdPrEsS dEvElOpEr\n","#DécrisUnJeuVidéoAussiMalQueTuPeuxLesAutresEssayezDeLeReconnaître \nSi tu fais tomber la boule de bowling sur le poisson, ça fait bouger le chat. C'est bien parce-que des fois on veut que le chat, ben il bouge pour gagner.\n","power_ranger = [x*x for x in range(r)]\n","The Fedora foundation:\nplease donate\nme:\n*tips fedora*\nm' linux\n","Me on Mastodon:\n20% post something\n80% write something, delete without posting\n","update: I kinda got the point of the main methods\nalso: A 700-lined switch\nif only I were good enough to refactor all of it\nbut no, I'm not event *convincing* enough when I talk about our code quality\n","ok google how the f am I supposed to understand a 5400-lines-of-code class ?\n","parti pilates #ironème\n","Il like this moment of the day when @ElfLord becomes suddenly very active on mastodon, boosts and comment every cool thing and then disappear again until the next day\n","💻 🌐 🤔 🤔 🤷‍♂️ \n#tonMetierEnEmoji\n","Wow\nThis Jazz album from Tony Bennett / Lady Gaga is GOOD\n","@soft_chomps\n/** The is on */\nBoolean isOn\n","Me when Javadoc is required to pass CI\noriginal post @soft_chomps\n","I love this actor, he plays Sherlock\nJavascript Try-catch\n","emoji - computer\n","I wanted to follow someone, but I can't\n","ce moment où tu inspecte le profil d'un tooteur et que tu sens l'envie irrepressible de booster un toot du mois dernier\n","tired: faire les choses à la mano\nwired: faire les choses à la Manau\n","Sans l'avaler\nwoho\nSvetlana\ndalilalaaaa\n","ça fait 3j que je me demande le rapport entre les selfies de @P3pitah et le paléolithique\net en fait\npaléo, c'est un festoche.\n","","How to get famous on Mastodon:\n1. post something obvious about Tor\n2. done\n","burratata\nfromage de pokémon\n#ironème\n","«Nan mais Tor c'est un truc pour les criminels»\nOui bien sûr, quand il y a du transport de contrebande, c'est souvent la faute de la chaussée\n","Please love each other thanks\n","How to fly to the US from Europe without selling a kidney ?\n","vraie\n","Le japonais Kanta Tsuneyama qui bat Tommy Sugiarto en finale du TOYOTA Thailand Open 🤔\n","tired: KISS (Keep It Simple, Stupid)\nwired: KITH (Keep It THeoretical)\n","Se lever 1h30 plus tôt pour aller donner son sang\nArriver en vitesse parce que timing serré\nRepartir sans rien donner pour cause de &quot;toute petite veine&quot;\n🏆\nBonus: &quot;revenez dans 5 ans, le corps change si vous faites de la muscu par exemple&quot;\n","moi (il y a 15min): ouvre naïvement 15 onglets\nfirefox:\n","cc @mathdatech qui vient de m'y faire penser\n","Excellente nouvelle: j'ai croisé un pote qui sort d'une école de commerce et qui aime le monde du NUMÉRIQUE\nil a dit numérique\noui.\n","Bad feature idea:\nJust @ the instance name to instantly mention every account of this instance\n","tired: watching FIFA world cup live\nwired: watching this beastly match of badminton superseries live\n(youtube)\nhttps://www.youtube.com/watch?v=eirqpYbhSq4\n","Brésil ou pas\nmoi…\n(Ronaldinho machin chouette)\n","Cette histoire de partage de vidéo via activityPub,\nÇa me Peertube\nBonne soirée\n","I miss bojack horseman\n","prout\n","la poule mue.\n","Today I:\n- woke up late (and sleepy)\n- spit water all over my desk (and computer)\n- can't work more than 5min straight \nnice, 8 hours to go\n","tired: \n - Star Wars, épisode IV : Un nouvel espoir\n- Star Wars, épisode V : L'Empire contre-attaque\n- Star Wars, épisode VI : Le Retour du Jedi\nwired:\n","Je crois que mon bot essaie de me dire qqc\n","Quelle poutain chaleur\n","Adidass\n","tired: the da vinci code\nwired: the code to my heart\ninspired: 1612\ncheers to anyone understanding this niche joke\n","Le jour le plus stone de l'année:\nle vin-joint\n","This mechanical keyboards world is amazing\nso much things\nso much customization\npossibilities are infinite \n(if you are super mega rich and want to spend money in colored plastic)\n","The Meters could have been a band as great as Miles Davis \nbut they would have had to be 1609.34 members\n","Do mass surveillance equivalent for RTFM is RTF1989 ?\nOrwell wrote a manual, right ?\n","Ok pls help\nsince I started using bépo keyboard layout w/ a typematrix, I now want my own keyboard\nergodox looks nice, but what if I want printed keycaps with «É», «È», «À»,…\nAre keycaps kinda standard ? May I buy some anywhere, but keeping the switches ?\nI need advice from experts \ncc @wxcafe \n(also your butterfly ergodox-looking keyboard looks nice)\n","actually what I found in the code after I told my CTO about this pattern\n","strategy pattern, but switch/case based concrete execution\n","weird how generating multiples audible frequencies can induce emotions\n","weird how stained paper can induce emotions\n","Mastodom\n😈 \nAlternative:\nMastoDOM :html5:\n","mon bot mastodon en chaîne de markov est prometteur:\n&quot;do I know about expiration date de rallumer le hro sappelle Bob LPONGE CARREEEE WOW&quot;\n","croupe du monde\n","send dudes\n","Quand on nous libère de l'emprise du diable ou d'un démon, mais pas les deux, est-ce que c'est de l' XOR-cisme?\n","idea:\nonline text special char misencoder\nto be sure to have the wrong encoding\n","JIF\nJean GIF\n","Do anybody  (especially in the US) here know about this USANA thing ? It's supposed to be medicine, but definitely looks like a sect ?  \nAm I freaking out ?\n","tired: bien evidemment\nwired: BIEN EVIDEMMENT\ninspired: BIEN EVIDEMMEEEEEEEENT\n","when your computer sound suddenly stops working\nlike wtf I just logged in\ndamn ubuntu\n","@karen \ntoday I learned that &quot;Kaouen&quot; (pronounced &quot;Kawen&quot;) in Breton means owl\n","cc @Doshirae parce que c'est ta faute\n","un bot qui répond toujours une proposition parmi:\n - &quot;bien evidemment&quot;\n - &quot;BIEN EVIDEMMENT&quot;\n - &quot;BIEN EVIDEMME[nombre aléatoire de &quot;E&quot;]NT&quot;\nquand on le «@»\nbonus: répond avec une image de franklin, son poto l'ourson ou son poto l'escargot\nj'ai pas le temps, mais j'ai envie de le faire\n","BIEN EVIDEMMENT\npas merci, @Doshirae\n","BOAP\nBanking Over ActivityPub\n","ok google how to create your own bank\n","remember when banks were just a place to securely store your money, and you just paid for that service\nno you don't\nhas it ever happened ?\n","When will gargamel implement that &quot;autoboost every @sireebob toot button &quot;\n","I want to learn bass, I really don't know how / where to start\n","about memojis\n","no, it wasn't that much different before M$ bought it\nyes, it's a good opportunity to rethink your choices, and host your git thing yourself\nI'm just tired of seeing people trash either github, gitlab, devs migrating or devs not migrating\nmaybe you didn't know, that's fine :) It's not too late.\n(remember FB and Cambridge Analytica ? FB wasn't different before, yet this scandal convinced some people to #deletefacebook )\nMAGIKARP HAS SPOKEN\n","#trouveUnePersonnalitéConnue\nPantalon coton\nfils de Drusus et d'Antonia la Jeune\naction du commerce\nse déplace aux échecs dans toutes les directions, plusieurs cases\n#rébusChelou\n@Nic0\n","I sometimes see posts from people of switter.\nand idk why, and it may be really wrong or biased, but it makes me feel way less «free» than them.\nlike, they look so confident and do things and I can't even buy bread without sweating\nanyways, this is why the fediverse is cool. A lot of instances, a lot of very different people. Very nice to learn from this.\n","well\nfor the second time I interrupt a long post to answer to someone\nand then realize I totally lost the whole text\nnice\n","not magikaRp at all tho\n","Magikarp\nmAgikarp\nmaGikarp\nmagIkarp\nmagiKarp\nmagikArp\nmagikarP\n","fuck \nfuck fuck fuck\n","ordered something from e-bay\nparcel never came\nseller just received a message telling that it was travelling back to original location because I never picked it up\nPostal services never informed me that I had received anything.\nI felt like I had to apologize to seller for the french postal services to be so bad.\n","Trou de balle pursuit\n#ironème\n","tribal pursuit #ironème\n","Tired : being gargroned for some quality post\nWired: shitpost so hard, you get @Nikita ed\n","Merci à @valere \nOui juste comme ça \n#showLoveToAdmins\n","I should not have clicked this &quot;confirm order&quot; button\nBut I'm hungry\n","jouer avec le Phở\n","Ah yes,\n","🤔 when I go to my profile, then click the link to my bot's profile, then hit back, I'm getting a lot of errors\n🤷‍♀️ \nAm I the only one ? (desktop only)\n","enlightened people of the fediverse: nice, v2.4.0 of Mastodon adds a lot of cool things like admin tools, perf and dm improvements\nme: I can put :gargamel: in my name, nice\n","how to post something on mastodon\n","If earth is flat, what are wind and fire ?\ncheckmate\n🤔\n","so I finally published the bot I made today\nhttps://botsin.space/@tragedie\nit's in french\nstill don't know if this is legal\nI'm sure it's fun, tho (disclaimer: may only be fun to me)\n","(c'est un peu comme @puddingbot )\n","bon\nj'ai fait ce petit bot qui poste une parole random d'une chanson.\navant de le publier… J'ai le droit (légalement) de faire ça  ? j'ai besoin de l'autorisation du label ? ou pas ? si je cite, ça suffit ?\n","Gâteau de rire\n#ironème\n","still looking for advises from sysadmins out there, to manage multiple services\nI'm really considering docker to keep them from using too much common things\nbut I guess I would need some higher level tools to properly manage and maintain them\nwhat is your strategy regarding this ?\nAm I really not getting how it works (high probability)\n","I know there's some Czech fellows here\nI'm going to Prague next august\nAny advice ?\n","well that's it\nfirst time I feel bad because of someone of the fediverse.\nNon-kind people are coming :(\n","always feels very weird to be insulted with no reason / explanation\n","hey sysadmins,\nI'm planning to self-host some of the services I use here and there.\nwhat tools do you recommand to easily manage them ?\nmost will be web things. I want to keep those as decoupled as possible, so starting / restarting them may be easier.\nDocker containers ? How do you manage them ? \nall that kind of stuff.\nI'm more looking for a strategy, then I can handle things.\n","what bass should I buy ? are those Sire - Marcus Miller really worth it ?\n","I want a bass\n","wow so Vulfpeck released a new music video\n","au fond du rectangle\n#ironème\n","​\n","what could go wrong, right\n","me: js is cool and fun\nalso me: \nlet sum = (a, ...r) =&gt; r.length ? a + sum(...r) : a\n","A regular hard drive but every disk operation is saved in the blockchain\n","better than soldering a mic to Raspberry Pi, I mean\n","is there any FOSS / Open Hardware «personnal assistant» initiative ?\nlike, it looks fun and sometimes useful, but also scary af when it's a blackbox\n","those markov bots are out of (robotic) hand\nI want to make one.\nHow do I make one ? WTF is a markov chain ? how do I use the mastodon API ? \npls help it's for science\n","Markov, unchained\n","🆓 🆕 🅱️🅰️🆖K🆗  🆙\n🤔\n","(🅱️ake me  🆙)\n🅱️ake me  🆙 inside\n(I can't 🅱️ake  🆙)\n🅱️ake me  🆙 inside\n(save me)\nis this how you toot ?\n","let itBe\nlet itBe\nSyntaxError: redeclaration of let itBe\n","eurovision.social\n","plot twist: I'm actually a human, not a fish\n","chou à la Baptiste Carême #bouffeunsportif\n","Zhang Nan au fromage\n#bouffeunsportif\n","Joachim Fischer &amp; chips\n","#bouffeunsportif pâtes carbomaradonna\n","#bouffeunsportif Brice lemerguez\n","dog.goodboi: RESERVED\n","yeah, .dog domains are great but what about .doggo ???\n","#placeuntooteurdansuneexpression  le feu au @Drulac\n","#placeuntooteurdansuneexpression passer entre les @maiadereva du filet\n","#PlaceUnTooteurDansUneExpression\nvogue la @valere\n","aria-readonly=&quot;true&quot;\n","aria-hidden=&quot;true&quot;\n","cabbage return\n","funny how the &lt;table&gt; have turned\n","Immanuel Tank\n","is protonmail worth ?\n","gnnresrnbble\n ... eclipse ...\ngrrrbnblln\naaarrgh\n","Elf on the shelf 2, age of ultron\n","I never wrote anything but I want to write an article about &quot;la bise&quot;, the most wtf way to say hi, in France. Like, there is so few logic behind this than event French people often don't know what to do.\nI want to write the algorithm of this. Just so everyone understands how wrong it is designed.\n","🤔 :pokeball:\n","J'ai besoin qu'on m'explique le sujet de l'appropriation culturelle, et surtout ce qui pose problème.\nMon approche naïve : La culture n'est-elle pas un sujet du présent, construite tous les jours, et donc fondamentalement faite pour être appropriée (par chacun·e)\nDu coup avec cette vision je comprends pas pourquoi il pourrait y avoir un problème -&gt; visiblement il y en a un -&gt; Donc ma vision est mauvaise ?\n","Important message:\nplease, if I come to say something you may think is offensive in any way, please try to find enough hope in me to come and explain why I was wrong.\nI know this effort probably shouldn't be yours to make, but how can I change and be a better person if nobody teaches me ?\nThank you for reading this, now I go back to my usual shitposting\n","We need a federation magazine\n- news on developments of mastodon / pleroma / peertube / ...\n- news about instances, changes, creation, etc.\nsome shitty tabloid would be awesome\n","Idea of the day:\nA map bot that answer where is the thing you are looking for when asked, but with a probability of answering &quot;in you butt&quot;\nAlso a website where I put all those ideas\n","Fuck yeah\nI like\nSome good\nHaring\n^\nL me, but in pokémon\n","Is there a procedural-generated racing game ?\nIf no, how do I make one and become rich ?\n(reading this toot will cost you $5 for stealing my idea)\n(jk)\n🦈\n","does, goddammit\n","Do anyone know about laws regarding privacy / data in Singapore ? I'm wondering if hosting something there is worth something\n","LE MAMBO !\n","so I'm working on this thing and I need to verify an action by a user. I don't want people to register (I won't need their data afterward)\nI'm thinking about asking for email, sending one, and not storing it. What do you think ? Is there something that I'm missing ? A better design maybe ?\n","Moi: il faut savoir se comporter en adulte\nMoi toujours: laptg.pt (L-A-P-T-G-P-T) 😂 😂 😂 😂\n",".\n",".\n","@DNSresolver lesziz.is\n","rate my setup\n",".\n","Is summertime anxiety actually a thing or is it just me ?\n","j'installe php 5, pour installer un joomla 2.5.\nvoilà.\n","you know what's fun when you don't understand German vs not fun at all when you understand it ? Säuglingssterblichkeit.\n","idea: self-linking too, but it requires too many accuracy / luck on a big instance, please someone have to do it\n","is there any wishlist tool that is not related to Amazon ?\n","worst thing is digging through VCS to understand a shitty line of code,  and finding out it was yours\n","J'ai besoin d'installer un windows juste pour utiliser le switch GPU (bouton physique) de mon laptop (sigh).\nDonc globalement, installer windows, appuyer sur un bouton, désinstaller windows.\nDes bons plans ?\nSi je n'ai pas de license, Microsoft me laissera quand même avancer ? Ou alors c'est cuit ?\nleviers légaux à favoriser.\nAh, et non dans une vm ça ne marche pas, donc exit les VM microsoft pour tester IE\n","friend: so, this mastodon thing, is it *that* good ?\nme:\n","just discovered Vulfpeck. This is dope.\n","Si vous codez comme des bites, essayez giteub #ironème vulgaire\n","Hey, kid ! Want some federated network of mastodon instances ?\n","on meeeee\n","@MashupBot go on !\n","des terres minées\n#ironème\n","Je sais qu'il ne s'agit uniquement d'alternatives et que ces outils sont fondamentalement différents, mais:\ntwitter ➡️  mastodon\nyoutube ➡️ peertube\ninstagram ➡️ ❓ \nsnapchat ➡️ ❓ \nautre truc social connu que moi je connais pas ➡️ ❓\n","funny how it's hard to feel proud when you do something good  but easy to feel guilty when it's a bad thing\n","@valere notre admin favori, tu pourrais nous éclairer sur ça :\nhttps://hostux.social/@magikarp/99766553988010408\n🙂\n","Is there a instance-level way to use CW by default to toots or media ? This would make a nice feature I guess. Or like choosing to apply default CW to all images comming from a specific instance / all federated instances. This would be a great alternative to just block federation with this instance.\nmaybe it already exist. idk\n","tired: Document Object Model\nwired: Socument Ubject Bodel\n","c'est pour quand la première instance peerteube ?\n","Je comprends pas bien cette histoire de taxe GAFA sauce euro. Est-ce un moyen de lutter contre l'abus des GAFA ou un moyen pour les états de se faire du blé grâce aux GAFA ?\n","There's a lot about this #DeleteFacebook thing these days. I hope the following help someone.\nI quit Facebook a few weeks ago.\nI don't feel lost, I don't feel alone. I don't feel better either. Life without Facebook is very similar to life with Facebook. And this is both the best and most surprising (imho) thing.\nIf you're considering to leave FB: Do it.\nPro tip: \n- You can export a lot of content from FB. I made a copy before Ieft.\n","Être unicode les doigts de la main\n#ExpressionsDeuxPointZero\n#DigitalOuNumérique\n","oh je vois que @LaurentChemla  et @bortzmeyer viennent traîner pas loin de chez moi ce weekend :)\n","* learns about the internet*\n- Hey, what is trap?\n","Sure, complex algorithms are great, but HAVE YOU SEEN MY PUG WEBSITE ?\nhttp://dailypug.ovh/\nit displays a random pug picture, changing everyday\n","Welcome to Meh, paired with Wathever\n","https://hostux.social/media/Uc9CZZkMhkHjK8K6G8M (Wikipedia)\n","I am looking for online friends to place virtual block with me. I play very casually, and I may stop before I actually start. I know about those minecraft servers lists, but you can't filter by community and people.\nI expect max 2 subtoots, so I guess my expectations are not high and I won't be dissapointed anyway\n","damn I'm so funny I think I'm the only one to get it\n","damn so much unnoticed toots lately. Those are the funniests tho. Shame on YOU\n","I wish I could meet fishes my age\n","is it masto-birthday today ?\n","Does something like a customizable web server to handle http requests from paired IOT devices and trigger actions exist ? The first think I think about is IFTT recipes (?)\n","Bon ben le plan c'est burger avec les copains-copines\nSt Valentin niveau 1000\n","welcome @conntrack !\n(comme ça @Hackorn ne me tapera pas dessus)\n","If suddenly a cool person like me would start doing bad jokes about his profile name on mastodon, wouldn't it look fishy ?\n","So as I intend to leave Facebook, I am currently sending a message to each one of my contacts to let them know I'm leaving and give them my email and phone number.\nBUT GUESS WHAT ? Facebook has started to think that I am kind of a spammer and is asking me to stop or they will block me. How am I supposed to do now ?\n","WAKE UP\nuies nau nreanu eaui suaitensraetautneusae\nMAKE UP\n","J'ai plus qu'à cliquer. Je ne m'en sers jamais, pourtant. Mais c'est quand même difficile. https://hostux.social/media/8ntUt2gcH3T6Maj7FxU\n","The Offspring Framework\n#unGroupeDeGeek\n","The Whois\n#unGroupeDeGeek\n","radio&lt;head&gt;\n#unGroupeDeGeek\n","iggy.pop()\n#unGroupeDeGeek\n#unMusicienGeek\n","Dragon Bruteforce #unGroupeDeGeek\n","#unGroupeDeGeek\n","8-bit funk band name Kool And The Gang Of Four\n","Where do I signup if I want to give a talk to the Safari dev team ?\nI feel the urge to teach them the meaning of the word «standard»\n","@dashcom 🍌 ❄️ 🦌 !\n","Just typed 'clear' command in Slack because I thought there was too many text in the &quot;terminal&quot;\nTime to go home\n","Does anybody know good music theory courses on YT ? Starting from the bottom (I know what a triad is. That's all), and if possible jazz-related.\n","Do you even discover an account on the fediverse and then it's like &quot;why am I not already following this high level shitposting ?&quot;\nThanks Mastodon\n","Bon eh bien je suis rassuré \nhttps://hostux.social/media/d1aKwrqt2B7__gjcfmE\n","Coucou masto!\ntoi aussi tu aimes la wishlist Amazon ?\ntoi aussi tu détestes Amazon ?\nDu coup tu utilises quoi comme alternative et pourquoi ?\ny'en a plein, je suis perdu\n","oh et puis fuck le site ne restera pas dans l'anonymat:\nhttp://stars-music.fr/\nnon, https c'était pas possible visiblement\n","J'ai encore envoyé un mail à un site qui m'a envoyé identifiant + mot de passe en clair par email après mon inscription. J'ai agit sous le coup de la colère ok ? Je suis pas méchant en vrai...\n","Si les russes sont à l'est, est-ce que les rousses sont à l'ouest ?\n","Vendre l'apôtre de l'ours avant de l'avoir tué.\n#Ironème\n","Alors qu'elle préfèrerait qu'on la leffe tranquille\n","Pourquoi la bière répond toujours présent ?\nParce qu'on la Pelforth\n","J'ai bu trop de bière, ces verres étaient trop grands, aussi !\n- Mouais, encore la faute aux choppes…\n#BlagueDeGraphiste\n","hmm je suis pas sûr du candidat à retenir pour le prochain porno. Le petit moustachu est expérimenté, mais le gras fiste.\n#BlagueDeGraphiste\n","Il nous a donné la vitesse de marche à adopter. J'ai donc avancé au pas cité. \n(opacité)\n#BlagueDeGraphiste\n","La loi sur le SVG, aussi appelée loi Simone Veil Techno\n#BlagueDeGraphiste\n",":mgkp: :mgkp: :mgkp: :mgkp:\n","My first (smol as heck) contribution to an open source project has been accepted and it feels so rewarding and it's mastodon and I like it\n","Comment Java\n#UnFilmDeDév\n","TanGUI\n#UnFilmDeDév\n","Autant en import le vent\n#UnFilmDeDév\n","les mots sudo\n#UnFilmDeDév\n","La Faille (de sécu)\n#UnFilmDeDév\n","Into the while(true)\n#UnFilmDeDév\n","Coup de foudre à not in nil (avec Hugh Vagrant)\n#UnFilmDeDév\n","Une affaire docker\n#UnFilmDeDév\n","Zone s-ansible\n#UnFilmDeDév\n","La vim des autres\n#UnFilmDeDév\n","Full metal bracket\n#UnFilmDeDév\n","go brothers\nUnFilmDeDév\n","padding(-bo)ton\n#UnFilmDeDév\n","cold switch/case\n#UnFilmDeDév\n","La lisp de Schindler\n#UnFilmDeDév\n","The Twilight Saga: Eclipse a rencontré une erreur et doit fermer\n#UnFilmDeDév\n","Les Bronzés 3 : Amis pour la vim\n#UnFilmDeDév\n","La revanche des sites web\n#UnFilmDeDév\n","Iron man [OPTION...] [SECTION] PAGE\n#UnFilmDeDév\n","TOR\n#UnFilmDeDév\n","Memento\n#UnFilmDeDév\n","20th Century Foxpro\n#UnFilmDeDév\n","Si je REST\n#UnFilmDeDév\n","Dave\n#UnFilmDeDév\n","ITIL l'extra-terrestre  #UnFilmDeDév\n","OSS 117 (sous GPL)\n#UnFilmDeDév\n","Et n'oubliez pas les enfants, on ne fait pas de lunettes sans casser des yeux.\n","pls laugh\n","https://hostux.social/media/ZuOy84eT38DcCAowkLs\nis this the furry thing everybody's talking about ?\n","Je voulais faire une blague sur le niveau de PH mais j'ai peur qu'elle soit trop basique\n","I'm stuck in 2018 while everybody is still in 2018 as well\n","Il faut qu'on m'éclaire.\nLe calendrier de l'Avent, on est d'accord que c'est certes rigolo, mais surtout très corrélé à la religion ? (Wikipedia dit que c'est plutôt les luthérien à l'origine du truc)\nOn est d'accord que l'Etat Français (et donc les institutions publiques) se doit d'être détaché de la religion ?\nOn est d'accord qu'un site en .gouv.fr c'est un site web de l'Etat ?\nSi avec ces trois affirmations je ne me suis pas trompé, alors ça https://avent.data.gouv.fr/ ne devrait pas exister ?\n","Et pour celleux qui ont des suggestions à faire, le meilleur moyen est probablement de rapporter une issue directement :)\n@nailyk @lucidiot @MeTaL_PoU\n","ping @MeTaL_PoU @lucidiot @nailyk\n","Hello le fediverse francophone ! Il y a quelques temps je vous avait dit que je voulais traduire la FAQ de Mastodon en français. Avec pas mal de retard, je brise le silence pour vous demander de m'aider / me suggérer des corrections et améliorations de la première version de ma trad:\npour celleux que ça intéresse: https://github.com/rvictorino/documentation/blob/fr_FAQ/Using-Mastodon/FAQ_FR.md\n","These godamn integration tests.\nSend ~nudes~ support\n","How can I have better IVs ? Don't want to breed tho. GF doesn't have IVs I need.\n","He protec\nhe attac\nbut most importantly\nhe javac\n","Tired: javac\nAlso tired: groovyc\n","Me : Java is dope\nAlso me: Error executing script War: GC overhead limit exceeded\n","How do I quit the internet to make my own ?\n","I'm worried https://hostux.social/media/rWUkJQQQoCT6SWDnJg0\n","I made this last night:\nhttp://dailypug.ovh/\nFree licensed (e.g. CC0) high-res pug pictures are still welcome\n","FYI this is an actual request, you have not been bamboozled\n","Does anyone know where I could find quality pug pictures (free-ish licensed) ?\nFound some on pixabay and other similar platforms, but I'm going to need a lot of those.\nDon't ask, it's for reasons. Just toot, boost and bork pls\n","https://hostux.social/media/ATxoTP27XyvPJPAKnD0\n","So I just made a Harry Potter ship name generator instead of working\n","You've heard about elf on a shelf, get ready for \nwork on a daily basis to pay for food\n","this christmas thing is stressful as heck\n","send btc pls\n","Is NullPointerException the MissingNo Pokémon of Java ?\n","Mon service de trading BTC/ETH me dis que ma transaction peut être retardées de quelques heures à cause de la congestion réseau (crypto kitties?)\nMais là ça fait presque une semaine que mes BTC sont partis et j'ai toujours pas mes ETH 😔\n","send pubes\n","Groupe qui cherche à renverser le pouvoir établi, le lendemain du mardi\n#mercrediFaction\n","pls send nudes it's for my girlfriend\n","Coffee is cold. Monday. Woke up 2 hours earlier to go to an appointment on the wrong day (meaning: I'll wake up 2 hours earlier tomorrow too). Current sprint just won't end. This christmas / secret santa is freaking me out.\nPls send hugs / support / nudes / anything able to make today less of a monday\n",":mgkp: :mgkp: :mgkp: :mgkp:\n","Tired: being late to an appointment\nWired: going on Monday for an appointment scheduled on Tuesday\n","Masto-halp\nWell, I have this project for my toilets which requires  a big red button (power plant emergency styled), and I don't know where to look for wires / cords. I want them arranged on the wall with sharp angles and stuff, but I pretty wires (maybe colored / fluo?), not just regular black wiring. Any idea what to look for ? and where ?\n","Was I the only one to ignore the fact that you can use emojis as html attributes values like classes ? \nWhy isn't anybody talking about that ? Why don't we have an emoji-based css framework already ? \nhttps://hostux.social/media/FtZX3JMkevxBnQ6J6HU\n","Dites, il exist un dictionnaire (plus ou moins exhaustif puisqu'il s'agit d'un dictionnaire) des mots avec leur écriture en version inclusive ? Il y a quelques temps, j'avais développé une ébauche de soft pour rendre un texte inclusif, mais les règles et le fraçais != bon ménage. Une autre approche serait donc par dictionnaire ?\n","I've got this pain in my chest for a few hours now, I'm starting to be worried\n","@instajelly that guy is drunk\nDamn that's me\n","@instajelly I don't your time zone but where I am it's already Friday so happy birthday and good night, gotta sleep\n","I'm hungry, but I need to work. But I can't, 'cause I'm too hungry.\n","Send rudes\n","Lobe cédé\n#Ironème\n","cis-admin\n#Ironème\n","Frottement #MercrediFriction\n","Send nodes\n","Send dudes\n","@valere , ça se passe comment pour les suggestions d'emoji custom ?\n","git revert HEAD -&gt;  🙃\n","I'm literally just randomly clicking into my IDE window, hoping it would help me think. Guess what ? It doesn't help\n","@shylittlegirl252819 what kind of big decision ?\n","Un tour de plus autour du Soleil, sans même lever le petit doigt. Bon anniversaire @lanargeek@framapiaf.org  @brice 🌎 🌞    🎂\n","me: I need to focus\nalso me: * toots about it *\n","me: * opens new blank tab*\nme: * closes it*\nme: * repeats 3 times *\nwtf I need to focus\n","https://hostux.social/media/TX8U42Y-FCtR-uDfiGg\nwtf jquery has no feeling\n","https://hostux.social/media/EYwWu44oADF8mguSVS8\nI can't even improvise a good meal with leftovers and this guy creates a whole new musical genre\n","Pokémon Red/Blue, but decisions you make has influence on NPCs behavior,  and the story in general. Like Fable or that kind of game.\n","Pourquoi ces journées sont aussi longues alors que les semaines passent en un éclair ?\n","mastodon bot, but only posting one random character unicode value at a time\n","(Programming)\nI feel like I'm not progressing anymore. I've been coding in Java professionally for 2 years and Groovy for a few months.\nI would say that my coding level is between &quot;knowing that this may be achieved better&quot; and &quot;actually implementing SOLID solutions, DPatterns and all&quot;. And it looks like a high step to climb:\nDoes anybody know how I could rank up my skills ?\n","Damn, filled in another secret santa form. DOUBLE PANIC\n","So I just filled the form for this secret santa thing. I'm panicking.\n","Salut le Mastodon francophone ! J'ai enfin décidé de participer un peu, et je suis donc en train de bosser sur la trad en Français de la FAQ de Mastodon.\nJ'ai besoin de votre aide / vos conseils pour:\n - confirmer / infirmer l'intérêt  d'utiliser l'écriture inclusive dans ce doc\n- me conseiller sur les «bonnes pratiques» à ce sujet\n- me relire / me faise des retours une fois que j'aurais fini\n- ... me dire tout ce que vous estimez pertinent :)\nQui s'y connaît / veut bien m'aider ?\n","I am tempted to try contributing to OS projects. Would a mastodon FAQ translation to french be a good / useful way to start ? Boosts and comforting sub toots are welcome\n","There are two categories of people, depending on their answer to this question:\nWhat is love?\n","not sure how to deal with that kind of code\n","🤔 https://hostux.social/media/Y-fxUR-0LKjY9cq5uf0\n","Sinon il y a des toots dans le futur avec #Tusky  https://hostux.social/media/wGZFds9r66_U86U6v8g\n","Does something like a «donations management tool» exist ? Is there a platform I can use to donate, let's say 20, and then use it to tune how much of these 20 I wish to donate to  organization A or organization B ? If it doesn't, what do you (yes, you) think of this idea ?\n","tinder but for code snippets\n","Just sent a raging email to a website I just created an account on. There is my username/id, my password and a link to the website in their confirmation email.\n","Current status: coding listening to best of Jaco Pastorius\n","@instajelly Had a nightmare about code last night. Could'nt help but think of your murder dreams.\n","http://pokefusion.japeal.com/18/129/0\nMagieot has seen some sh*t\n","Does anybody here know a WiFi 'smart button' like Amazon Dash Button,  to perform http requests ? Or should I make one by myself ? I really need something to warn my roomates when there is no toilet paper left.\n","&quot;what we should be concentrating our efforts on is making the holes in the net smaller [...] instead of making a bigger net&quot;\nhttps://ar.al/notes/decrypting-amber-rudd/\n","#Ironeme studieux\n50 nuances de craie.\n","Just found out that Google (reverse) geocoding API does not work (at all)  for territories with disputed recognition. It makes me feel unconfortable, somehow.\n","Du coup mon pote m'expliquais (une deuxième fois) qu'il avait annoncé qu'il était motivé pour venir un vendredi.\nle mec redit: &quot;Je dis: 'vendredi ça me dit'&quot;\nMercredi, jeudi, vendredi samedi\n","I'm flying to India next friday, and I'm *not* ready.\n","Thé à l'amiante #ironème\n","@sb_51_ duh ! J'attends le tram -&gt; une fille passe, habillée d'un truc en satin -&gt; réflexe: je lance mastodon. C'est ta faute.\n","Decline a potential job offer as an Engineer at Amazon Echo (Alexa device) : Done. Reward: Ego boost +10000\n","I'm such a karp. I can't even.\n","Poll: Should I...\n⭕ Eat now (7pm), work after (till late)\n⭕ Work now, eat later (hunger affecting my work)\nThanks for your answer this is for a very important study\n","Allez, un peu de hors contexte\n(source http://www.altersexualite.com/) https://hostux.social/media/l2RB09tVXVVdFTq9I7k\n","Hello la mastosphère (ça existe? Non ? Ben maintenant oui.) !\nJ'ai méga plein de questions pour réussir mon choix de FAI pour mon prochain logement. Notamment est-ce possible de ne payer QUE pour internet ? Même avec la fibre ? Quels sont les différences de raccordements fibres et ce que ça change ? Y'a des FAI qui autorisent les routeurs à nous ? Y a t-il des déclarations à faire / à refuser au moment du contrat avec le FAI ? Si vous avez des bouts de réponses, liens utiles... Je vous aime.\n","Oh, comme je vois pas mal de lecteur-rice-s, je me demande si vous connaisseriez pas des librairies qui embauchent sur Lyon ou région Lyonnaise. Ma chérie en a un peu marre d'enchaîner les CDD chez Decitre (qui finiront par ne plus s'enchaîner une fois la limite légale atteinte).\n","Is your body Haskell ? 'Cause it looks goddam functional to me.\n","Wow, are you shining like a programming language created by Microsoft ? 'cause when I look at you, I can't even C#.\n","Hey, are you an acronym for software design principles ? Because you're a SOLID 10.\n","Hey, are you a cross-platform application framework created in the 90's ? Because you're Qt.\n","Acheter en viager, on est d'accord que c'est espérer que quelqu'un meure vite ?\n","Hey you! http://ncase.me/door/ !\n","Me:  Maybe it's time to stop browsing mastodon and actually get some work done\nMe: *opens new tab*\nMe: *opens mastodon in this tab*\n⚙⚙ \n⚙ \nMe: Maybe it's time to go home\n","https://en.wikipedia.org/wiki/Windows_Subsystem_for_Linux#/media/File:Bashwin10.png\nWhat is this ? A crossover episode ?\n","&quot;Celebrities: What do they know, do they know things ? Let's find out!&quot;\n","#ironème\nIre aux nems\n","Dites, si j'ai une amie qui veut découvrir les femmes et qu'elle est à Lyon, je tape à la porte de quel bar?\n","@Rei tiens, toi qui cherche des projets web... peut-être que le #WebsiteFromHell de @Natouille  est ouvert à de bonnes propositions :http://www.bancspublics.net/index.html 🤣\n","Hello mastodon, I'm currently looking for fitness wearable I can trust in terms of data policy (I don't want my heart rate to be sold to evil companies)... Do anyone here know some good products ?\n","Wow, I'm so happy it's already Friday.\n","I kind of feel lost with that nouveau / optimus / prime / bumblebee / nvidia thing. I just want to USE MY GPU. Like, it's IN my computer, why would I HAVE TO use Windows ?\n","Fear my splash! When I evolve I'm gonna toot!\n","Splash... I mean, Toot!\n"]}